Revit 2027 API
SolidCurveIntersection.SegmentCount Property
 The number of segments in the results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
public:
property int SegmentCount {
	int get ();
}
member SegmentCount : int with get
Property Value
Int32
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace